In [6]:
from pydoc import describe

import pandas as pd;

In [7]:
series = pd.Series([1,2,3,4,5]); #it is 1D
series
series1 = pd.Series([1,2,3,4,5],index=['a','b','c','d','e']);
series1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [8]:
dataForm = pd.DataFrame({"name":["raj","harry"], "marks": [100,89]}) # it is 2D
dataForm

    name  marks
0    raj    100
1  harry     89

In [9]:
df = pd.read_csv("PandasA2Z/data.csv")

In [10]:
df

,Series_reference,Period,Data_value,Suppressed,STATUS,UNITS,Magnitude,Subject,Group,Series_title_1,Series_title_2,Series_title_3,Series_title_4,Series_title_5
0,BDCQ.SEA1AA,2011.06,80078.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
1,BDCQ.SEA1AA,2011.09,78324.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
2,BDCQ.SEA1AA,2011.12,85850.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
3,BDCQ.SEA1AA,2012.03,90743.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
4,BDCQ.SEA1AA,2012.06,81780.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
24506,BDCQ.SEE3999A,2017.06,NaN,Y,F,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,NaN,NaN
24507,BDCQ.SEE3999A,2017.09,NaN,Y,F,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,NaN,NaN
24508,BDCQ.SEE3999A,2017.12,NaN,Y,F,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,NaN,NaN
24509,BDCQ.SEE3999A,2018.03,NaN,Y,F,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,NaN,NaN
24510,BDCQ.SEE3999A,2018.06,NaN,Y,F,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,NaN,NaN

In [11]:
first5Data = df.head();
first5Data # it gives starting 5 datas

,Series_reference,Period,Data_value,Suppressed,STATUS,UNITS,Magnitude,Subject,Group,Series_title_1,Series_title_2,Series_title_3,Series_title_4,Series_title_5
0,BDCQ.SEA1AA,2011.06,80078.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
1,BDCQ.SEA1AA,2011.09,78324.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
2,BDCQ.SEA1AA,2011.12,85850.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
3,BDCQ.SEA1AA,2012.03,90743.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
4,BDCQ.SEA1AA,2012.06,81780.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN

In [12]:
last5Data = df.tail();
last5Data #it gives last 5 datas

,Series_reference,Period,Data_value,Suppressed,STATUS,UNITS,Magnitude,Subject,Group,Series_title_1,Series_title_2,Series_title_3,Series_title_4,Series_title_5
24506,BDCQ.SEE3999A,2017.06,NaN,Y,F,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,NaN,NaN
24507,BDCQ.SEE3999A,2017.09,NaN,Y,F,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,NaN,NaN
24508,BDCQ.SEE3999A,2017.12,NaN,Y,F,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,NaN,NaN
24509,BDCQ.SEE3999A,2018.03,NaN,Y,F,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,NaN,NaN
24510,BDCQ.SEE3999A,2018.06,NaN,Y,F,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,NaN,NaN

In [13]:
describeData = df.describe();
describeData # it gives mean count standard deviation max min

,Period,Data_value,Magnitude,Series_title_4,Series_title_5
count,24511.000000,2.167200e+04,24511.000000,0.0,0.0
mean,2017.576132,7.342422e+04,2.277753,NaN,NaN
std,3.987928,2.125253e+05,2.911822,NaN,NaN
min,2011.060000,1.171797e+00,0.000000,NaN,NaN
25%,2014.090000,1.919150e+03,0.000000,NaN,NaN
50%,2017.120000,1.417900e+04,0.000000,NaN,NaN
75%,2021.060000,6.088450e+04,6.000000,NaN,NaN
max,2025.030000,2.321295e+06,6.000000,NaN,NaN

In [14]:
df.info() # it gives data informations

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24511 entries, 0 to 24510
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Series_reference  24511 non-null  object
 1   Period            24511 non-null  float64
 2   Data_value        21672 non-null  float64
 3   Suppressed        2839 non-null   object
 4   STATUS            24511 non-null  object
 5   UNITS             24511 non-null  object
 6   Magnitude         24511 non-null  int64
 7   Subject           24511 non-null  object
 8   Group             24511 non-null  object
 9   Series_title_1    24511 non-null  object
 10  Series_title_2    24511 non-null  object
 11  Series_title_3    24511 non-null  object
 12  Series_title_4    0 non-null      float64
 13  Series_title_5    0 non-null      float64
dtypes: float64(4), int64(1), object(9)
memory usage: 2.6+ MB

### Data Selection

In [15]:
df["Period"] #it gives entire period column
type(df["Period"]) # it gives type of the column basically it is a series

pandas.core.series.Series

In [16]:
df[["Series_reference","Data_value"]]

      Series_reference  Data_value
0          BDCQ.SEA1AA     80078.0
1          BDCQ.SEA1AA     78324.0
2          BDCQ.SEA1AA     85850.0
3          BDCQ.SEA1AA     90743.0
4          BDCQ.SEA1AA     81780.0
...                ...         ...
24506    BDCQ.SEE3999A         NaN
24507    BDCQ.SEE3999A         NaN
24508    BDCQ.SEE3999A         NaN
24509    BDCQ.SEE3999A         NaN
24510    BDCQ.SEE3999A         NaN

[24511 rows x 2 columns]

In [17]:
df.dropna() #it remove all the rows where data is missing

Empty DataFrame
Columns: [Series_reference, Period, Data_value, Suppressed, STATUS, UNITS, Magnitude, Subject, Group, Series_title_1, Series_title_2, Series_title_3, Series_title_4, Series_title_5]
Index: []

In [19]:
#df.fillna(0, inplace=True); so fillna function change all na block to 0 and inplace if true then it modify the original data set
newDataframe = df.fillna(0);#here inplace is false so it not modify the original data set
newDataframe

,Series_reference,Period,Data_value,Suppressed,STATUS,UNITS,Magnitude,Subject,Group,Series_title_1,Series_title_2,Series_title_3,Series_title_4,Series_title_5
0,BDCQ.SEA1AA,2011.06,80078.0,0,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,0.0,0.0
1,BDCQ.SEA1AA,2011.09,78324.0,0,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,0.0,0.0
2,BDCQ.SEA1AA,2011.12,85850.0,0,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,0.0,0.0
3,BDCQ.SEA1AA,2012.03,90743.0,0,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,0.0,0.0
4,BDCQ.SEA1AA,2012.06,81780.0,0,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
24506,BDCQ.SEE3999A,2017.06,0.0,Y,F,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,0.0,0.0
24507,BDCQ.SEE3999A,2017.09,0.0,Y,F,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,0.0,0.0
24508,BDCQ.SEE3999A,2017.12,0.0,Y,F,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,0.0,0.0
24509,BDCQ.SEE3999A,2018.03,0.0,Y,F,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,0.0,0.0
24510,BDCQ.SEE3999A,2018.06,0.0,Y,F,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,0.0,0.0

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24511 entries, 0 to 24510
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Series_reference  24511 non-null  object
 1   Period            24511 non-null  float64
 2   Data_value        21672 non-null  float64
 3   Suppressed        2839 non-null   object
 4   STATUS            24511 non-null  object
 5   UNITS             24511 non-null  object
 6   Magnitude         24511 non-null  int64
 7   Subject           24511 non-null  object
 8   Group             24511 non-null  object
 9   Series_title_1    24511 non-null  object
 10  Series_title_2    24511 non-null  object
 11  Series_title_3    24511 non-null  object
 12  Series_title_4    0 non-null      float64
 13  Series_title_5    0 non-null      float64
dtypes: float64(4), int64(1), object(9)
memory usage: 2.6+ MB

In [21]:
df['Period'] = df['Period'].astype(int) #it convert the data type of a colum

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24511 entries, 0 to 24510
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Series_reference  24511 non-null  object
 1   Period            24511 non-null  int64
 2   Data_value        21672 non-null  float64
 3   Suppressed        2839 non-null   object
 4   STATUS            24511 non-null  object
 5   UNITS             24511 non-null  object
 6   Magnitude         24511 non-null  int64
 7   Subject           24511 non-null  object
 8   Group             24511 non-null  object
 9   Series_title_1    24511 non-null  object
 10  Series_title_2    24511 non-null  object
 11  Series_title_3    24511 non-null  object
 12  Series_title_4    0 non-null      float64
 13  Series_title_5    0 non-null      float64
dtypes: float64(3), int64(2), object(9)
memory usage: 2.6+ MB

In [26]:
df["zeros"] = [0 for i in range(len(df))]; #it add another column called zeros start from 0->length of df and add 0 in every rows

In [28]:
df.info();

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24511 entries, 0 to 24510
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Series_reference  24511 non-null  object
 1   Period            24511 non-null  int64
 2   Data_value        21672 non-null  float64
 3   Suppressed        2839 non-null   object
 4   STATUS            24511 non-null  object
 5   UNITS             24511 non-null  object
 6   Magnitude         24511 non-null  int64
 7   Subject           24511 non-null  object
 8   Group             24511 non-null  object
 9   Series_title_1    24511 non-null  object
 10  Series_title_2    24511 non-null  object
 11  Series_title_3    24511 non-null  object
 12  Series_title_4    0 non-null      float64
 13  Series_title_5    0 non-null      float64
 14  zeros             24511 non-null  int64
dtypes: float64(3), int64(3), object(9)
memory usage: 2.8+ MB

In [29]:
def fx(a):
    return a*a;
df["zeros+1"] = df["zeros"].apply(fx)#it add a new row called zeros+1 which helps to add new values which is multiply of ith row value with it means take ith row value as a parameter and do the operations

In [32]:
df.to_csv("PandasA2Z/newData.csv") #it's create a new csv file with my modifing datas

In [34]:
df.to_csv("PandasA2Z/withoutIndexdata.csv",index=False)#it gives csv file without index

In [35]:
df1 = pd.DataFrame({
    "name": ["raj","harry"],
    "marks": [100,89]
})
df1

    name  marks
0    raj    100
1  harry     89

In [36]:
df2 = pd.DataFrame({
    "name": ["anjan","arpan"],
    "marks":[40,20]
})
df2

    name  marks
0  anjan     40
1  arpan     20

In [38]:
pd.concat([df1,df2]) #it merge two data frame

    name  marks
0    raj    100
1  harry     89
0  anjan     40
1  arpan     20

In [39]:
pd.merge(df1,df2,on="name") #it merge on name basis

Empty DataFrame
Columns: [name, marks_x, marks_y]
Index: []